# 设置工作空间
# 把“数据及程序”文件夹拷贝到F盘下，再用setwd设置工作空间
setwd("F:/数据及程序/chapter6/示例程序")

# ---------------------------------求斜率--------------------------------------
# 读取数据
Power <- read.csv("./data/用户日用电量.csv")

# 设置一个向量k存放求出的每天的斜率值
k <- rep(0, nrow(Power))
Down <- Power$日电量

for (i in 1:nrow(Power)) {  # 循环所有天，求出每天的前后5天共计11天的平均斜率k
  if (i <= 5) {
    l <- 1:(i + 5)  # 前面不足5天时求平均斜率用到的天数
  }
  if (i >5 & i < (nrow(Power) - 5)) {
    l <- (i - 5):(i + 5)  # 前后均满足5天时的求平均斜率用到的天数
  }
  if (i >= (nrow(Power) - 5)) {
    l <- (i-5):nrow(Power)  # 后面不足5天时求平均斜率用到的天数
  }
  k[i] <- cov(Down[l], l) / var(l)  # 计算第i天的斜率，公式类似求协方差除方差
}


# -----------------------------标记用电量趋势----------------------------------

Decrease <- rep(0, nrow(Power))  # 设置变量D，用于存放电量趋势标记1或0

for (i in 2:nrow(Power)) {  # 从第二天开始循环，求出所有天的电量趋势标记
  if (k[i] < k[i - 1]) {
    Decrease[i] <- 1  # 当天比前一天斜率低，标记为1
  } 
  if (k[i] >= k[i - 1]) { 
    Decrease[i] <- 0  # 当天高于或等于前一天斜率，标记为0
  }
}

# --------------------------统计11天内的趋势下降次数---------------------------

Total <- rep(0, nrow(Power)) #设置变量T，存放对第i天前4后5共计10天的电量趋势汇总值

for (i in 1:nrow(Power)) {  # 循环所有天，求出每天前4后5共计10天的趋势汇总
  if (i < 5) {
    m <- 1:(i + 5)  # 前面不足5天要汇总的天数
  } 
  if (i >= 5 & i <= nrow(Power) - 5) {
    m <- (i - 4):(i + 5)  # 满足前后5天时研汇总的天数
  }  
  if (i > nrow(Power) - 5) {
    m <- (i - 4):nrow(Power)  # 后面不足5天时用到的天数
  }  
  Total[i] <- sum(Decrease[m])
}
